# BendingDetailCustomFieldProperties Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties Class
Members See Also
---
Represents the properties of a Bending Detail Custom Field.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class BendingDetailCustomFieldProperties : ICustomFieldProperties,
	IDisposable
```

Visual Basic
---
```text
Public Class BendingDetailCustomFieldProperties _
	Implements ICustomFieldProperties, IDisposable
```

Visual C++
---
```text
public ref class BendingDetailCustomFieldProperties : ICustomFieldProperties,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..BendingDetailCustomFieldProperties
# See Also
BendingDetailCustomFieldProperties Members
Autodesk.Revit.DB.Structure Namespace